In [39]:
# 데이터 불러오기

In [40]:
# 1) csv파일 불러오기

In [41]:
import pandas as pd

In [42]:
pd.read_csv('C:/ex/data/student.csv', encoding="cp949")

   ID  학생명    키  몸무게  나이 성별
0   1  홍일동  166   59  19  남
1   2  홍이동  168  600  19  여
2   3  홍삼동  170   71  19  남
3   4  홍사동  172   55  19  여
4   5  홍오동  174   66  19  남

In [43]:
df_stu1 = pd.read_csv('C:/ex/data/student.csv', encoding="cp949")

In [44]:
type(df_stu1)

pandas.core.frame.DataFrame

In [45]:
df_stu1.columns

Index(['ID', '학생명', '키', '몸무게', '나이', '성별'], dtype='object')

In [46]:
df_stu1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   학생명     5 non-null      object
 2   키       5 non-null      int64
 3   몸무게     5 non-null      int64
 4   나이      5 non-null      int64
 5   성별      5 non-null      object
dtypes: int64(4), object(2)
memory usage: 372.0+ bytes

In [47]:
df_stu1.ID

0    1
1    2
2    3
3    4
4    5
Name: ID, dtype: int64

In [48]:
df_stu1.학생명

0    홍일동
1    홍이동
2    홍삼동
3    홍사동
4    홍오동
Name: 학생명, dtype: object

In [49]:
df_stu1['몸무게']

0     59
1    600
2     71
3     55
4     66
Name: 몸무게, dtype: int64

In [50]:
type(df_stu1['몸무게']) # 시리즈란 인덱스가 있는 배열

pandas.core.series.Series

In [51]:
df_stu1.describe()

             ID           키        몸무게    나이
count  5.000000    5.000000    5.00000   5.0
mean   3.000000  170.000000  170.20000  19.0
std    1.581139    3.162278  240.34496   0.0
min    1.000000  166.000000   55.00000  19.0
25%    2.000000  168.000000   59.00000  19.0
50%    3.000000  170.000000   66.00000  19.0
75%    4.000000  172.000000   71.00000  19.0
max    5.000000  174.000000  600.00000  19.0

In [52]:
df_stu1.head(3)

   ID  학생명    키  몸무게  나이 성별
0   1  홍일동  166   59  19  남
1   2  홍이동  168  600  19  여
2   3  홍삼동  170   71  19  남

In [53]:
df_stu1.head(-2)

   ID  학생명    키  몸무게  나이 성별
0   1  홍일동  166   59  19  남
1   2  홍이동  168  600  19  여
2   3  홍삼동  170   71  19  남

In [54]:
df_stu1.describe(include='all')

              ID  학생명           키        몸무게    나이   성별
count   5.000000    5    5.000000    5.00000   5.0    5
unique       NaN    5         NaN        NaN   NaN    2
top          NaN  홍일동         NaN        NaN   NaN    남
freq         NaN    1         NaN        NaN   NaN    3
mean    3.000000  NaN  170.000000  170.20000  19.0  NaN
std     1.581139  NaN    3.162278  240.34496   0.0  NaN
min     1.000000  NaN  166.000000   55.00000  19.0  NaN
25%     2.000000  NaN  168.000000   59.00000  19.0  NaN
50%     3.000000  NaN  170.000000   66.00000  19.0  NaN
75%     4.000000  NaN  172.000000   71.00000  19.0  NaN
max     5.000000  NaN  174.000000  600.00000  19.0  NaN

In [55]:
df_stu1['키']

0    166
1    168
2    170
3    172
4    174
Name: 키, dtype: int64

In [56]:
df_stu1['키'].values

array([166, 168, 170, 172, 174], dtype=int64)

In [57]:
height = df_stu1['키'].values

In [58]:
height.var()

8.0

In [59]:
# help(pd.DataFrame)

In [60]:
stu_dic = {'학생명' : ['홍일동','홍이동','홍삼동','홍사동','홍오동' ]}

In [61]:
type(stu_dic)

dict

In [62]:
id = {'id' : [1,2,3,4,5]}

In [63]:
import numpy as np

In [64]:
dt = np.array([[1, '홍일동',166,59,19,'남'],
               [2, '홍이동',168,600,19,'여'],
               [3, '홍삼동',170,71,19,'남'],
               [4, '홍사동',172,55,19,'여'],
               [5, '홍오동',174,66,19,'남']])

In [65]:
pd.DataFrame(data=dt, columns=['id', '이름', '키', '몸무게', '나이', '성별'])

  id   이름    키  몸무게  나이 성별
0  1  홍일동  166   59  19  남
1  2  홍이동  168  600  19  여
2  3  홍삼동  170   71  19  남
3  4  홍사동  172   55  19  여
4  5  홍오동  174   66  19  남

In [66]:
dt = np.array([[1,2,3,4,5],
               ['가', '나', '다', '라', '마'],
               ['a', 'b', 'c', 'd', 'e']])

In [67]:
dt

array([['1', '2', '3', '4', '5'],
       ['가', '나', '다', '라', '마'],
       ['a', 'b', 'c', 'd', 'e']], dtype='<U11')

In [68]:
dt2 = dt.transpose()

In [69]:
dt2

array([['1', '가', 'a'],
       ['2', '나', 'b'],
       ['3', '다', 'c'],
       ['4', '라', 'd'],
       ['5', '마', 'e']], dtype='<U11')

In [70]:
pd.DataFrame(dt2, columns=['number', 'korean language', 'alphabet'])

  number korean language alphabet
0      1               가        a
1      2               나        b
2      3               다        c
3      4               라        d
4      5               마        e

In [71]:
pd.Series(np.array({'키':[166,168,170,172,174]}))

0    {'키': [166, 168, 170, 172, 174]}
dtype: object

In [72]:
stu_df = pd.DataFrame(data=dt, columns=['id', '이름', '키', '몸무게', '나이', '성별'])

ValueError: Shape of passed values is (3, 5), indices imply (3, 6)

In [ ]:
stu_df.columns

Index(['이름', '키', '몸무게', '나이', '성별'], dtype='object')

In [ ]:
stu_df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
stu_df.set_index('id', inplace=True)

KeyError: "None of ['id'] are in the columns"

In [ ]:
stu_df

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여
3   홍삼동  170   71  19  남
4   홍사동  172   55  19  여
5   홍오동  174   66  19  남

In [ ]:
stu_df.iloc[0]

이름     홍일동
키      166
몸무게     59
나이      19
성별       남
Name: 1, dtype: object

In [ ]:
stu_df.loc['1']

이름     홍일동
키      166
몸무게     59
나이      19
성별       남
Name: 1, dtype: object

In [ ]:
stu_df["성별"]

id
1    남
2    여
3    남
4    여
5    남
Name: 성별, dtype: object

In [ ]:
stu_df[['키','나이']]

      키  나이
id
1   166  19
2   168  19
3   170  19
4   172  19
5   174  19

In [ ]:
stu_df

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여
3   홍삼동  170   71  19  남
4   홍사동  172   55  19  여
5   홍오동  174   66  19  남

In [ ]:
stu_df.iloc[[1, 4]]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
5   홍오동  174   66  19  남

In [ ]:
stu_df.loc[['2', '5']]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
5   홍오동  174   66  19  남

In [ ]:
stu_df.loc["2"]["몸무게"]

'600'

In [ ]:
stu_df.loc["3"][["몸무게", '나이']]

몸무게    71
나이     19
Name: 3, dtype: object

In [ ]:
stu_df.loc[["3", "5"]][["몸무게", '나이']]

   몸무게  나이
id
3   71  19
5   66  19

In [ ]:
import numpy as np

In [ ]:
np.array([i for i in stu_df['키'] if int(i) >= 170])

array(['170', '172', '174'], dtype='<U3')

In [ ]:
stu_df['키'].astype('int') >= 170

id
1    False
2    False
3     True
4     True
5     True
Name: 키, dtype: bool

In [ ]:
stu_df[stu_df['키'].astype('int') >= 170]

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  71  19  남
4   홍사동  172  55  19  여
5   홍오동  174  66  19  남

In [ ]:
stu_df['성별'] == '남'

id
1     True
2    False
3     True
4    False
5     True
Name: 성별, dtype: bool

In [ ]:
stu_df[stu_df['키'].astype('int') >= 170][stu_df['성별'] == '남']['이름']

C:\Users\ysj\AppData\Local\Temp\ipykernel_20024\1829058348.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  stu_df[stu_df['키'].astype('int') >= 170][stu_df['성별'] == '남']['이름']

id
3    홍삼동
5    홍오동
Name: 이름, dtype: object

In [ ]:
stu_df[(stu_df['키'].astype('int') >= 170) & (stu_df['성별'] == '남')]

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  71  19  남
5   홍오동  174  66  19  남

In [ ]:
stu_df[(stu_df['몸무게'].astype('int') >= 50) & (stu_df['성별'] == '여')]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
4   홍사동  172   55  19  여

In [ ]:
stu_df['키'] = stu_df['키'].astype('int')
stu_df['몸무게'] = stu_df['몸무게'].astype('int')

In [ ]:
stu_df[(stu_df['키'] < 170) & (stu_df['몸무게'] >= 50)]

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여

In [ ]:
stu_df[(stu_df['키'] < 170) | (stu_df['몸무게'] >= 50)]

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여
3   홍삼동  170   71  19  남
4   홍사동  172   55  19  여
5   홍오동  174   66  19  남

In [ ]:
pd.Series(['남', '여'])

0    남
1    여
dtype: object

In [ ]:
pd.Series({'성별' : ['남', '여']})

성별    [남, 여]
dtype: object

In [ ]:
di = {'a':'apple', 'b': 'banana', 'c':'candy'}

In [ ]:
pd.Series(di)

a     apple
b    banana
c     candy
dtype: object

In [ ]:
ser1 = pd.Series(di)

In [ ]:
pd.DataFrame(ser1)

        0
a   apple
b  banana
c   candy

In [ ]:
df_fruit = pd.DataFrame(ser1)

In [ ]:
df_fruit.columns=['fruit']

In [ ]:
df_fruit

    fruit
a   apple
b  banana
c   candy

In [ ]:
df_fruit.columns

Index(['fruit'], dtype='object')

In [ ]:
df_fruit.rename(columns={'fruit': 'fruit2'}, inplace=True)

In [ ]:
df_fruit

   fruit2
a   apple
b  banana
c   candy

In [ ]:
di3 = {'a' : 'albatross', 'b' : 'bald_eagle', 'c' : 'crane'}

In [ ]:
df_fruit['bird'] = di3

In [ ]:
df_fruit

   fruit2      animal        bird
a   apple    anaconda   albatross
b  banana  black_yart  bald_eagle
c   candy         cat       crane

In [ ]:
df_fruit.loc['c']['animal']

'cat'

In [ ]:
df_fruit

   fruit2      animal        bird
a   apple    anaconda   albatross
b  banana  black_yart  bald_eagle
c   candy         cat       crane

In [ ]:
df_fruit['animal']['c']

'cat'

In [ ]:
df_fruit

   fruit2      animal        bird
a   apple    anaconda   albatross
b  banana  black_yart  bald_eagle
c   candy         cat       crane

In [ ]:
df_fruit.iloc[2, 1] = 'dog'

In [ ]:
df_fruit

   fruit2      animal        bird
a   apple    anaconda   albatross
b  banana  black_yart  bald_eagle
c   candy         dog       crane

In [ ]:
df_fruit.drop('animal', axis=1, inplace=True)

NameError: name 'df_fruit' is not defined

In [ ]:
df_fruit

   fruit2        bird
a   apple   albatross
b  banana  bald_eagle
c   candy       crane

In [ ]:
df_fruit.drop('b', axis=0, inplace=True)

In [ ]:
df_fruit

  fruit2       bird
a  apple  albatross
c  candy      crane